cf_billing/Documents/энргНачислениеПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргНачислениеПени</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргВзаиморасчетыПоПени</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыИспользованные</xr:Item>
				<xr:Item>AccumulationRegister.энргНачислениеПени</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыПоступившие</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансы</xr:Item>
				<xr:Item>InformationRegister.энргВыполненныеНачисленияПени</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьДанныеНачислений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗадолженности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейПросрочки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаРефинансирования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаНачисленияПени</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейПросрочкиСДатыНачалаНачисленийПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентЧислитель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентЗнаменатель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачисленияПени</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/энргНачислениеПени/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДанныеОплаты() Экспорт
	
	ГраницыОтчетногоПериода = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация, Район, ПериодНачисления);	
	ЗавершениеОП 	= ГраницыОтчетногоПериода.ЗавершениеОП;	

	
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("МКД", 				МКД);
	Запрос.УстановитьПараметр("Дата", 				ЗавершениеОП-1);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.УстановитьПараметр("ОбъемНачислений", 	ЭтотОбъект.Движения.энргНачислениеПени.Выгрузить());
	Запрос.Текст 	=
	
	"ВЫБРАТЬ
	|	ОбъемНачислений.Организация КАК Организация,
	|	ОбъемНачислений.ПериодРасчета КАК ПериодНачисления,
	|	ОбъемНачислений.Район КАК Район,
	|	&МКД КАК МКД,
	|	ОбъемНачислений.Абонент КАК Абонент,
	//|	&Дата КАК Дата,
	|	ОбъемНачислений.Период КАК Дата,
	|	&Ссылка КАК ДокРегистратор,
	|	ОбъемНачислений.Сумма КАК СуммаОплаты,
	|	ЛОЖЬ КАК ЭтоОплата,
	|	ЛОЖЬ КАК ЭтоКорректировкаОплаты,
	|	ОбъемНачислений.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ОбъемНачислений
	|ИЗ
	|	&ОбъемНачислений КАК ОбъемНачислений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргПерерасчет.Ссылка КАК Ссылка,
	|	энргПерерасчет.Район КАК Район,
	|	энргПерерасчет.Организация КАК Организация
	|ПОМЕСТИТЬ ДанныеШапки
	|ИЗ
	|	Документ.энргНачислениеПени КАК энргПерерасчет
	|ГДЕ
	|	энргПерерасчет.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъемНачислений.Организация КАК Организация,
	|	ОбъемНачислений.ПериодНачисления КАК ПериодНачисления,
	|	ОбъемНачислений.Район КАК Район,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ КАК МКД,
	|	ОбъемНачислений.Абонент КАК Абонент,
	|	ОбъемНачислений.Дата КАК Дата,
	|	ОбъемНачислений.ДокРегистратор КАК ДокРегистратор,
	|	СУММА(ОбъемНачислений.СуммаОплаты) КАК СуммаОплаты,
	|	ОбъемНачислений.ЭтоОплата КАК ЭтоОплата,
	|	ОбъемНачислений.ЭтоКорректировкаОплаты КАК ЭтоКорректировкаОплаты,
	|	МАКСИМУМ(ОбъемНачислений.Поставщик) КАК Поставщик
	|ИЗ
	|	ОбъемНачислений КАК ОбъемНачислений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
	|			ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.КлючПомещения
	|		ПО ОбъемНачислений.Абонент = энргАбоненты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъемНачислений.Организация,
	|	ОбъемНачислений.ПериодНачисления,
	|	ОбъемНачислений.Район,
	|	ОбъемНачислений.ЭтоОплата,
	|	ОбъемНачислений.Абонент,
	|	ОбъемНачислений.ЭтоКорректировкаОплаты,
	|	ОбъемНачислений.Дата,
	|	ВЫБОР
	|		КОГДА энргКлючиПомещений.ЧастныйСектор
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
	|		ИНАЧЕ энргКлючиПомещений.Строение
	|	КОНЕЦ,
	|	ОбъемНачислений.ДокРегистратор";
 

	ДополнительныеСвойства.Вставить("ДанныеОплаты", Запрос.Выполнить());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ПроведениеРазрешено	= Ложь;
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
 	
	Ответственный = Пользователи.ТекущийПользователь();
		
	ДополнительныеСвойства.Вставить("Кассир", 						Ответственный);
	ДополнительныеСвойства.Вставить("ИсточникПоступления", 			Неопределено);
	ДополнительныеСвойства.Вставить("ЭтоОплата", 					Ложь);
	ДополнительныеСвойства.Вставить("ОтложеннаяЗапись", 			Истина);
	ДополнительныеСвойства.Вставить("ГруппаАбонентов",				Истина);	
	
	Если ПометкаУдаления Тогда
		Для Каждого Набор Из Движения Цикл
			Набор.Записать();
		КонецЦикла;
	КонецЕсли;
	
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
